
const courses = [
"Εισαγωγή στην Πληροφορική",
"Προγραμματισμός Ι",
"Προγραμματισμός ΙΙ",
"Βάσεις Δεδομένων",
"Δομές Δεδομένων και Αλγόριθμοι",
"Ανάλυση και Σχεδίαση Συστημάτων",
"Δίκτυα Υπολογιστών",
"Ασφάλεια Πληροφοριών",
"Τεχνητή Νοημοσύνη",
"Μηχανική Μάθηση",
"Ανάπτυξη Εφαρμογών Ιστού",
"Κινητές Εφαρμογές",
"Υπολογιστική Νέφη",
"Ανάλυση Δεδομένων", 
];

const list = document.getElementById("ulid");       
courses.forEach(course => {
    const li = document.createElement("li");
    li.textContent = course;
    list.appendChild(li);
});

